cities = ["Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург"]
buttons = ['Опубликовать', 'Создать объявление заново']
channel_ids_long = {'Новосибирск': '-1002010810169', 'Москва': '-1002115842002', 'Екатеринбург': '-1002028710164', 'Санкт-Петербург': '-1002144192009'}
channel_ids_short = {'Новосибирск': '-1002120433604', 'Москва': '-1002106897762', 'Екатеринбург': '-1002008160160', 'Санкт-Петербург': '-1001856471244'}


base_headings = {'Бизнес': '#biz ',
            'Психология': '#Psy ',
            'Эзотерические': '#magic ',
            'Мужские': '#мужские ',
            'Женские': '#женские ',
            'Детские(с детьми)': '#детские ',
            'Образование/тренинги/обучение': '#обучение ',
            'Культура и искусство': '#культура ',
            'Музыкально-танцевальные': '#муз ',
            'Здоровье и спорт': '#здоровье ',
            'Настолки и дружеские встречи': '#games ',
            'Бесплатные': '#free💚 '}


biz_hashtags =  ['#networking', '#gameBiz', '#forum', '#marketing', '#sale', '#тренинг', '#manBiz', '#wonanBiz', '#ИИbiz']
psyco_hashtags = ['#отношения', '#тренинг']
magic_hashtags = ['#тренинг']
men_hashtags = ['#тренинг']
women_hashtags = ['#тренинг, #девишник']
children_hashtags = ['#длямам']
edu_hashtags = ['#тренинг']
culture_hashtags = ['#театр', '#выставка']
music_hashtags = ['#концерт']
health_hashtags = ['#йога', '#хоккей', '#баскетбол', '#волейбол', '#футбол']
friends_hashtags = ['#мафия', '#НЕТворкинг', '#мозгоштурмы']
free_hashtags = ['#знакомства', '#молодёжное_пространство']

other_hashtags = {
    'Бизнес': biz_hashtags,
    'Психология': psyco_hashtags,
    'Эзотерические': magic_hashtags,
    'Мужские': men_hashtags,
    'Женские': women_hashtags,
    'Детские(с детьми)': children_hashtags,
    'Образование/тренинги/обучение': edu_hashtags,
    'Культура и искусство': culture_hashtags,
    'Музыкально-танцевальные': music_hashtags,
    'Здоровье и спорт': health_hashtags,
    'Настолки и дружеские встречи': friends_hashtags,
    'Бесплатные': free_hashtags
}